In [36]:
import numpy as np
import pandas as pd

In [37]:
df = pd.read_csv('AgeDataset-V1.csv', sep=',', header=None)

/var/folders/bd/sbl18k4d4h514z7k4t21vbfw0000gn/T/ipykernel_44016/2845674233.py:1: DtypeWarning: Columns (6,7,9) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('AgeDataset-V1.csv', sep=',', header=None)

In [38]:
# Preprocessing Data

# Dropping the first 3 columns which has  ID, name, and description
newDataFrame = df.drop(columns=df.iloc[:,0:3])
# Updating the column to have names rather than number
newDataFrame.columns = newDataFrame.iloc[0]

newDataFrame.head()

,Gender,Country,Occupation,Birth year,Death year,Manner of death,Age of death
0,Gender,Country,Occupation,Birth year,Death year,Manner of death,Age of death
1,Male,United States of America; Kingdom of Great Bri...,Politician,1732,1799,natural causes,67
2,Male,United Kingdom,Artist,1952,2001,natural causes,49
3,Male,United States of America,Politician,1809,1865,homicide,56
4,Male,Archduchy of Austria; Archbishopric of Salzburg,Artist,1756,1791,NaN,35

In [39]:
# Removing the row that has column names
newDataFrame = newDataFrame.drop(index=0)

In [40]:
# Updated 
newDataFrame.head()

,Gender,Country,Occupation,Birth year,Death year,Manner of death,Age of death
1,Male,United States of America; Kingdom of Great Bri...,Politician,1732,1799,natural causes,67
2,Male,United Kingdom,Artist,1952,2001,natural causes,49
3,Male,United States of America,Politician,1809,1865,homicide,56
4,Male,Archduchy of Austria; Archbishopric of Salzburg,Artist,1756,1791,NaN,35
5,Male,Holy Roman Empire; Austrian Empire,Artist,1770,1827,NaN,57

In [41]:
# Only keep Male/Female as gender for simplicity. 
# Remove all rows that don't have Male/Female

newDataFrame["Gender"].unique()

array(['Male', 'Female', nan, 'Transgender Female', 'Intersex',
       'Transgender Person; Intersex; Transgender Male', 'Non-Binary',
       'Eunuch; Male', 'Transgender Male', 'Eunuch', 'Intersex; Male',
       'Transgender Female; Female', 'Transgender Female; Male',
       'Female; Male', 'Intersex; Transgender Male',
       'Transgender Male; Female', 'Transgender Male; Male',
       'Intersex; Female', 'Transgender Female; Intersex',
       'Female; Female', 'Non-Binary; Intersex'], dtype=object)

In [42]:
newDataFrame = newDataFrame.loc[newDataFrame["Gender"].isin(['Male', 'Female'])]

In [43]:
#Countries will be split into a single value.
newDataFrame['Country'] = newDataFrame['Country'].str.split(';').str[0]

In [44]:
newDataFrame.head()

,Gender,Country,Occupation,Birth year,Death year,Manner of death,Age of death
1,Male,United States of America,Politician,1732,1799,natural causes,67
2,Male,United Kingdom,Artist,1952,2001,natural causes,49
3,Male,United States of America,Politician,1809,1865,homicide,56
4,Male,Archduchy of Austria,Artist,1756,1791,NaN,35
5,Male,Holy Roman Empire,Artist,1770,1827,NaN,57

In [50]:
newDataFrame['Manner of death']
newDataFrame.replace([np.nan], "Unknown Cause")

,Gender,Country,Occupation,Birth year,Death year,Manner of death,Age of death
1,Male,United States of America,Politician,1732,1799,natural causes,67
2,Male,United Kingdom,Artist,1952,2001,natural causes,49
3,Male,United States of America,Politician,1809,1865,homicide,56
4,Male,Archduchy of Austria,Artist,1756,1791,Unknown Cause,35
5,Male,Holy Roman Empire,Artist,1770,1827,Unknown Cause,57
...,...,...,...,...,...,...,...
1222998,Male,Unknown Cause,Physician,1903,1991,Unknown Cause,88
1222999,Male,Unknown Cause,Unknown Cause,1891,1929,Unknown Cause,38
1223001,Male,Switzerland,Entrepreneur,1857,1924,Unknown Cause,67
1223008,Male,United Kingdom,Artist,1887,1915,Unknown Cause,28
1223009,Male,Germany,Artist,1938,2017,Unknown Cause,79